#include "systick.h"
static unsigned char fac_us  = 0;	//us延时倍乘数
static unsigned short fac_ms = 0;	//ms延时倍乘数
/*********************************************************************************************************
* 函 数 名 : Systick_Inti
* 功能说明 : 初始化系统滴答
* 形    参 : clk：系统运行频率
* 返 回 值 : 无
* 备    注 : 外部时钟源 = 系统运行频率 / 8；
*********************************************************************************************************/ 
void Systick_Init(unsigned char clk)
{
	SysTick->CTRL &= ~(1<<2);	//选择外部时钟作为滴答的时钟源
	fac_us = clk / 8.0;			//得到计1us需要计的数  21
	fac_ms = clk / 8.0 * 1000;	//得到计1ms需要计的数
}
/*********************************************************************************************************
* 函 数 名 : Delay_Us
* 功能说明 : us级延迟
* 形    参 : us：需要延迟的us数
* 返 回 值 : 无
* 备    注 : 最大延迟时间 = （2^24）/ 21= 798915(us)，注意：尽量不要在中断中调用
*********************************************************************************************************/ 
void Delay_Us(unsigned int us)  //10*21
{
	unsigned int temp = 0;
	SysTick->LOAD = us*fac_us;				//计21个数是1us
	SysTick->VAL  = 0;						   //清除当前计数值,清溢出标记位
	SysTick->CTRL |= (1<<0);				//使能计数器
	do
	{										//必须要先读出寄存器的值再判断，否则会产生误差
		temp = SysTick->CTRL;				//等待第16位为1
	}while(!(temp&(1<<16))&&(temp&(1<<0)));	//并且确定定时器还在运行
	SysTick->CTRL &= ~(1<<0);				//关闭计数器
}
/*********************************************************************************************************
* 函 数 名 : Delay_Ms
* 功能说明 : ms级延迟
* 形    参 : ms：要延迟的ms数
* 返 回 值 : 无
* 备    注 : 最大延迟 = （2^24-1）/ 21 = 798(ms)
*********************************************************************************************************/ 
void Delay_ms(unsigned int Ms)
{
	unsigned int temp = 0;
	SysTick->LOAD = Ms*fac_ms;					//计10.5个数是1us，1ms有1000us
	SysTick->VAL  = 0;							//清除当前计数值
	SysTick->CTRL |= (1<<0);					//使能计数器
	do
	{											//必须要先读出寄存器的值再判断，否则会产生误差
		temp = SysTick->CTRL;					//等待第16位为1
	}while(!(temp&(1<<16))&&(temp&(1<<0)));		//并且确定定时器还在运行
	SysTick->CTRL &= ~(1<<0);					//关闭计数器
}

